In [1]:
# Import Libraries and Dependencies
import pandas as pd
import matplotlib.pyplot as plt

### 1. Combine and Clean the Data
#### Import CSVs

In [2]:
# Read the CSV files into DataFrame
df_2020 = pd.read_csv('Resources/athletic_sales_2020.csv')
df_2021 = pd.read_csv('Resources/athletic_sales_2021.csv')

In [3]:
# Display the 2020 sales DataFrame
df_2020.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [4]:
# Display the 2021 sales DataFrame
df_2021.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,65,750,487500,121875.00,Outlet
1,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,51,233,11883,3208.41,Outlet
2,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,50,275,137500,82500.00,Outlet
3,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,47,77,3619,2714.25,Online
4,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,64,225,14400,5184.00,Online

#### Check the data types of each DataFrame

In [5]:
# Check the 2020 sales data types.
df_2020.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [6]:
# Check the 2021 sales data types.
df_2021.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Combine the sales data by rows.

In [7]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.


# Add a 'Year' column to each DataFrame
df_2020['Year'] = 2020
df_2021['Year'] = 2021

# Concatenate the DataFrames
combined_df=pd.concat([df_2020,df_2021])   

# Reset the index of the combined DataFrame
combined_df.reset_index(drop=True,inplace=True)

# Print the combined DataFrame
combined_df.head(20)

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method,Year
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store,2020
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online,2020
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet,2020
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet,2020
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet,2020
5,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,47,336,15792,9633.12,Online,2020
6,West Gear,1128299,1/2/20,Northeast,Pennsylvania,Philadelphia,Men's Street Footwear,35,450,157500,63000.00,Outlet,2020
7,West Gear,1128299,1/2/20,Northeast,Pennsylvania,Philadelphia,Men's Street Footwear,27,158,4266,1791.72,Outlet,2020
8,Foot Locker,1185732,1/2/20,Northeast,New York,New York,Men's Athletic Footwear,47,260,12220,5132.40,Online,2020
9,West Gear,1128299,1/2/20,Northeast,Pennsylvania,Philadelphia,Men's Street Footwear,32,122,3904,1991.04,Online,2020
10,Foot Locker,1185732,1/2/20,Northeast,New York,New York,Men's Athletic Footwear,36,320,11520,4032.00,Outlet,2020
11,Foot Locker,1185732,1/2/20,Northeast,New York,New York,Men's Athletic Footwear,50,1000,500000,150000.00,In-store,2020
12,West Gear,1128299,1/3/20,Northeast,Pennsylvania,Philadelphia,Men's Athletic Footwear,44,117,5148,1904.76,Online,2020
13,West Gear,1128299,1/3/20,Northeast,Pennsylvania,Philadelphia,Men's Athletic Footwear,35,135,4725,1464.75,Outlet,2020
14,Foot Locker,1185732,1/3/20,Northeast,New York,New York,Women's Street Footwear,32,350,11200,4144.00,Outlet,2020
15,Foot Locker,1185732,1/3/20,Northeast,New York,New York,Women's Street Footwear,40,1000,400000,140000.00,In-store,2020
16,West Gear,1128299,1/3/20,Northeast,Pennsylvania,Philadelphia,Men's Athletic Footwear,45,450,202500,50625.00,Outlet,2020
17,Foot Locker,1185732,1/3/20,Northeast,New York,New York,Women's Street Footwear,36,250,9000,4140.00,Online,2020
18,West Gear,1128299,1/4/20,Northeast,Pennsylvania,Philadelphia,Women's Street Footwear,36,140,5040,2368.80,Outlet,2020
19,West Gear,1128299,1/4/20,Northeast,Pennsylvania,Philadelphia,Women's Street Footwear,41,117,4797,2590.38,Online,2020

In [8]:
# Check for null values
null_values = combined_df.isnull().sum()

# Print the null values
print(null_values)

retailer            0
retailer_id         0
invoice_date        0
region              0
state               0
city                0
product             0
price_per_unit      0
units_sold          0
total_sales         0
operating_profit    0
sales_method        0
Year                0
dtype: int64

In [9]:
# Check the data type of each column
column_data_types = combined_df.dtypes

# Print the data types
print(column_data_types)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
Year                  int64
dtype: object

In [10]:
# Convert "invoice_date" to datetime data type
combined_df["invoice_date"] = pd.to_datetime(combined_df["invoice_date"], dayfirst=True)
# Print the updated DataFrame
print(combined_df.head(5))

      retailer  retailer_id invoice_date     region         state  \
0  Foot Locker      1185732   2020-01-01  Northeast      New York
1  Foot Locker      1185732   2020-01-01  Northeast  Pennsylvania
2  Foot Locker      1185732   2020-01-01  Northeast  Pennsylvania
3  Foot Locker      1185732   2020-01-01  Northeast      New York
4  Foot Locker      1185732   2020-01-01  Northeast  Pennsylvania

           city                product  price_per_unit  units_sold  \
0      New York  Men's Street Footwear              50        1200
1  Philadelphia        Women's Apparel              68          83
2  Philadelphia        Women's Apparel              75         275
3      New York  Men's Street Footwear              34         384
4  Philadelphia        Women's Apparel              53          83

   total_sales  operating_profit sales_method  Year
0       600000         300000.00     In-store  2020
1         5644           2426.92       Online  2020
2       206250          61875.00       Outlet  2020
3        13056           6789.12       Outlet  2020
4         4399           1407.68       Outlet  2020

/var/folders/4k/4d4vp_nd5pl5m3d4q6qvwrdw0000gn/T/ipykernel_3642/739800641.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  combined_df["invoice_date"] = pd.to_datetime(combined_df["invoice_date"], dayfirst=True)

In [11]:
# Confirm that the "invoice_date" data type has been changed.
print(combined_df['invoice_date'].dtype)

datetime64[ns]

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [12]:
# Show the number products sold for region, state, and city.

# Group the data by region, state, and city, and calculate the count of products sold

production_based_on_geo = combined_df.groupby(['region', 'state', 'city'])['units_sold'].sum()

# Print the result
print(production_based_on_geo)


# Show the top 5 results.
sorted_production_based_on_geo = production_based_on_geo.sort_values(ascending=False)

# Select the top 5 rows
production_based_on_geo.head(5)

region     state           city
Midwest    Illinois        Chicago            25407
           Indiana         Indianapolis       26332
           Iowa            Des Moines         23446
           Kansas          Wichita            29463
           Michigan        Detroit            50095
           Minnesota       Minneapolis        20415
           Missouri        St. Louis          36404
           Montana         Billings           42713
           Nebraska        Omaha              19154
           North Dakota    Fargo              22781
           Ohio            Columbus           47781
           South Dakota    Sioux Falls        22973
           Wisconsin       Milwaukee          23950
Northeast  Connecticut     Hartford           34696
           Delaware        Wilmington         30275
           Maine           Portland           22410
           Maryland        Baltimore          20818
           Massachusetts   Boston             32895
           New Hampshire   Manchester         40812
           New Jersey      Newark             26540
           New York        Albany             57186
                           New York          111954
           Pennsylvania    Philadelphia       27662
           Rhode Island    Providence         27473
           Vermont         Burlington         38685
           West Virginia   Charleston         29873
South      Alabama         Birmingham         63327
           Arkansas        Little Rock        48468
           Louisiana       New Orleans        57615
           Mississippi     Jackson            56814
           Oklahoma        Oklahoma City      40459
           Tennessee       Knoxville          66077
           Texas           Dallas             69178
                           Houston            90322
Southeast  Florida         Miami              73135
                           Orlando            60295
           Georgia         Atlanta            56391
           Kentucky        Louisville         28664
           North Carolina  Charlotte          62936
           South Carolina  Charleston         72610
           Virginia        Richmond           52969
West       Alaska          Anchorage          30815
           Arizona         Phoenix            46919
           California      Los Angeles        76384
                           San Francisco      85478
           Colorado        Denver             41378
           Hawaii          Honolulu           40375
           Idaho           Boise              63827
           Nevada          Las Vegas          51831
           New Mexico      Albuquerque        52633
           Oregon          Portland           50536
           Utah            Salt Lake City     48548
           Washington      Seattle            46611
           Wyoming         Cheyenne           50228
Name: units_sold, dtype: int64

region   state     city
Midwest  Illinois  Chicago         25407
         Indiana   Indianapolis    26332
         Iowa      Des Moines      23446
         Kansas    Wichita         29463
         Michigan  Detroit         50095
Name: units_sold, dtype: int64

#### Using `pivot_table`

In [13]:
# Show the number products sold for region, state, and city.
pvt_production_geo = pd.pivot_table(combined_df, index=['region', 'state', 'city'], values='units_sold', aggfunc='sum')


# Show the top 5 results.
pvt_production_geo.sort_values(by="units_sold",ascending=False)

                                         units_sold
region    state          city
Northeast New York       New York            111954
South     Texas          Houston              90322
West      California     San Francisco        85478
                         Los Angeles          76384
Southeast Florida        Miami                73135
          South Carolina Charleston           72610
South     Texas          Dallas               69178
          Tennessee      Knoxville            66077
West      Idaho          Boise                63827
South     Alabama        Birmingham           63327
Southeast North Carolina Charlotte            62936
          Florida        Orlando              60295
South     Louisiana      New Orleans          57615
Northeast New York       Albany               57186
South     Mississippi    Jackson              56814
Southeast Georgia        Atlanta              56391
          Virginia       Richmond             52969
West      New Mexico     Albuquerque          52633
          Nevada         Las Vegas            51831
          Oregon         Portland             50536
          Wyoming        Cheyenne             50228
Midwest   Michigan       Detroit              50095
West      Utah           Salt Lake City       48548
South     Arkansas       Little Rock          48468
Midwest   Ohio           Columbus             47781
West      Arizona        Phoenix              46919
          Washington     Seattle              46611
Midwest   Montana        Billings             42713
West      Colorado       Denver               41378
Northeast New Hampshire  Manchester           40812
South     Oklahoma       Oklahoma City        40459
West      Hawaii         Honolulu             40375
Northeast Vermont        Burlington           38685
Midwest   Missouri       St. Louis            36404
Northeast Connecticut    Hartford             34696
          Massachusetts  Boston               32895
West      Alaska         Anchorage            30815
Northeast Delaware       Wilmington           30275
          West Virginia  Charleston           29873
Midwest   Kansas         Wichita              29463
Southeast Kentucky       Louisville           28664
Northeast Pennsylvania   Philadelphia         27662
          Rhode Island   Providence           27473
          New Jersey     Newark               26540
Midwest   Indiana        Indianapolis         26332
          Illinois       Chicago              25407
          Wisconsin      Milwaukee            23950
          Iowa           Des Moines           23446
          South Dakota   Sioux Falls          22973
          North Dakota   Fargo                22781
Northeast Maine          Portland             22410
          Maryland       Baltimore            20818
Midwest   Minnesota      Minneapolis          20415
          Nebraska       Omaha                19154

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [14]:
# Show the total sales for the products sold for each region, state, and city.
# Group the data by region, state, and city, and calculate the sum of the sales
total_sales_df = combined_df.groupby(['region', 'state', 'city'])['units_sold'].sum()


# Show the top 5 results.
total_sales_df.sort_values(ascending=False).head(5)

region     state       city
Northeast  New York    New York         111954
South      Texas       Houston           90322
West       California  San Francisco     85478
                       Los Angeles       76384
Southeast  Florida     Miami             73135
Name: units_sold, dtype: int64

#### Using `pivot_table`

In [15]:
# Show the total sales for the products sold for each region, state, and city.
pvt_total_sales = combined_df.pivot_table(index=['region', 'state', 'city'], values='total_sales', aggfunc='sum')



# Optional: Rename the "total_sales" column to "Total Sales"
pvt_total_sales.rename(columns={'total_sales':'Total Sales'}, inplace=True)


# Show the top 5 results.
pvt_total_sales.sort_values(by='Total Sales',ascending=False).head(5)

                                        Total Sales
region    state          city
Northeast New York       New York          39801235
West      California     San Francisco     33973228
Southeast Florida        Miami             31600863
          South Carolina Charleston        29285637
          Florida        Orlando           27682851

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [16]:
# Show the total sales for the products sold for each retailer, region, state, and city.
total_product_sales = combined_df.groupby(['retailer', 'region', 'state', 'city'])['total_sales'].sum()

# Rename the "total_sales" column to "Total Sales"
total_product_sales.rename('Total Sales',inplace=True)   



# Show the top 5 results.
total_product_sales.sort_values(ascending=False).head(5)

retailer     region     state           city
West Gear    West       California      San Francisco    32794405
Kohl's       West       California      Los Angeles      25127160
Foot Locker  Northeast  New York        New York         25008568
West Gear    West       Washington      Seattle          24862675
Foot Locker  Southeast  South Carolina  Charleston       24822280
Name: Total Sales, dtype: int64

#### Using `pivot_table`

In [17]:
# Show the total sales for the products sold for each retailer, region, state, and city.
pvt_total_sales = combined_df.pivot_table(index=['retailer', 'region', 'state', 'city'], values='total_sales', aggfunc='sum')



# Optional: Rename the "total_sales" column to "Total Sales"
pvt_total_sales.rename(columns={'total_sales':'Total Sales'}, inplace=True)


# Show the top 5 results.
pvt_total_sales.sort_values(by='Total Sales', ascending=False).head(5)

                                                    Total Sales
retailer    region    state          city
West Gear   West      California     San Francisco     32794405
Kohl's      West      California     Los Angeles       25127160
Foot Locker Northeast New York       New York          25008568
West Gear   West      Washington     Seattle           24862675
Foot Locker Southeast South Carolina Charleston        24822280

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [18]:
# Filter the sales data to get the women's athletic footwear sales data.

women_athletic_footwear_sales = combined_df[combined_df['product'] == "Women's Apparel"]
#This retailer has the most total sales (Walmart)
women_athletic_footwear_sales.sort_values(by="total_sales",ascending=False).head(1)

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method,Year
5194,Walmart,1128299,2021-06-17,Southeast,Florida,Orlando,Women's Apparel,110,750,825000,371250.0,In-store,2021

#### Using `groupby`

In [19]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
total_sales_women = women_athletic_footwear_sales.groupby(['retailer', 'region', 'state', 'city'])['units_sold'].sum()

# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
total_sales_women.rename('womens_Footwear_Units_Sold', inplace=True)
# Show the top 5 results.
total_sales_women.sort_values(ascending=False).head(5)

retailer       region  state       city
West Gear      West    California  San Francisco    14480
Sports Direct  South   Texas       Dallas           13056
Kohl's         West    California  Los Angeles      12968
Walmart        South   Texas       Houston          12797
Sports Direct  South   Tennessee   Knoxville        12345
Name: womens_Footwear_Units_Sold, dtype: int64

#### Using `pivot_table`

In [20]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.

pvt_women_athletic_footwear_sales = women_athletic_footwear_sales.pivot_table(index=['retailer', 'region', 'state', 'city'], values='units_sold', aggfunc='sum') 

# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
pvt_women_athletic_footwear_sales.rename(columns={'units_sold':'Womens_Footwear_Units_Sold'},inplace=True)

# Show the top 5 results.
pvt_women_athletic_footwear_sales.sort_values(by='Womens_Footwear_Units_Sold',ascending=False).head(5)

                                               Womens_Footwear_Units_Sold
retailer      region state      city
West Gear     West   California San Francisco                       14480
Sports Direct South  Texas      Dallas                              13056
Kohl's        West   California Los Angeles                         12968
Walmart       South  Texas      Houston                             12797
Sports Direct South  Tennessee  Knoxville                           12345

### 5. Determine the Day with the Most Women's Athletic Footwear Sales

In [21]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.
pvt_invoice = women_athletic_footwear_sales.pivot_table(index=["invoice_date"], values='total_sales', aggfunc='sum')

# Optional: Rename the "total_sales" column to "Total Sales"
pvt_invoice.rename(columns={"total_sales":"Total Sales"},inplace=True)

# Show the table.
pvt_invoice.head(10)

              Total Sales
invoice_date
2020-01-01         216293
2020-01-04         197440
2020-01-05         327400
2020-01-13         189096
2020-01-19         216162
2020-01-24         526520
2020-01-25         294052
2020-01-30         497338
2020-01-31         377778
2020-02-03         294002

In [22]:
# Resample the pivot table into daily bins, and get the total sales for each day.
daily_resampled = pvt_invoice.resample("1D").sum()

# Sort the resampled pivot table in ascending order on "Total Sales".
sorted_daily_resampled = daily_resampled.sort_values(by="Total Sales",ascending=True)
print(sorted_daily_resampled)

#Printing the with the most sales
print(sorted_daily_resampled.tail(1).index[0])

              Total Sales
invoice_date
2020-12-28              0
2020-09-30              0
2020-09-29              0
2021-07-24              0
2020-09-27              0
...                   ...
2020-04-24        1603544
2021-11-17        1802076
2021-12-16        1983497
2021-07-16        2271581
2021-06-17        2577406

[726 rows x 1 columns]
2021-06-17 00:00:00

### 6.  Determine the Week with the Most Women's Athletic Footwear Sales

In [23]:
# Resample the pivot table into weekly bins, and get the total sales for each week.
weekly_resampled = pvt_invoice.resample('W').sum()

# Sort the resampled pivot table in ascending order on "Total Sales".
sorted_weekly_resampled = weekly_resampled.sort_values(by="Total Sales",ascending=True)


print(sorted_weekly_resampled)
print(sorted_weekly_resampled.tail(1).index[0])

              Total Sales
invoice_date
2020-04-05              0
2020-10-18              0
2020-08-16              0
2020-02-16              0
2020-07-12              0
...                   ...
2021-10-17        4579211
2021-12-19        4709095
2021-11-14        4900510
2021-09-12        5114216
2021-10-10        6190185

[104 rows x 1 columns]
2021-10-10 00:00:00